#include <msp430F5529.h>

#define CPU_F ((double)16000000)
#define delay_Nms(x) __delay_cycles((long)(CPU_F*(double)x/1000000000.0))
#define delay_nns(x) __delay_cycles((long)(CPU_F*(double)x/1000000000.0))
#define Delay_Nms(x) __delay_cycles((long)(CPU_F*(double)x/1000.0))

#define LCD1602_DATA P3OUT	            //定义lcd数据端口---P3
#define LCD1602_CMDOut    P6DIR|=0x70      //P6口 0111 0000三位设置为输出
/**********RS---P45************/
#define SET1602_RS  P6OUT|=BIT6    //RS=1
#define CLR1602_RS  P6OUT&=~BIT6    //RS=0

/**********RW---P46************/
#define SET1602_RW  P6OUT|=BIT5    //RW=1
#define CLR1602_RW  P6OUT&=~BIT5    //RW=0

/**********EN---P47************/
#define SET1602_EN  P6OUT|=BIT4	//EN=1
#define CLR1602_EN  P6OUT&=~BIT4    //EN=0

char lcd_buff0[16]={"1234567890abcdef"};//定义lcd1602显示缓冲区
char lcd_buff1[16]={"1234567890abcdef"};


//********************************************************************************
//* 名    称：delay_nns()
//* 功    能：ns级延时，在24M的外部晶振情况下，_nop_()延时时间为41ns
//* 入口参数：m
//* 返回参数：
//********************************************************************************
/*void delay_nns(unsigned char m)
{
	int l=0;
	while(m--)
		{l++;}
	l=0;
}*/

/**************************************************************************************************
** 函数名称:Check_Busy
** 功能描述:检测忙信号
** 入口参数:
** 返回参数:
***************************************************************************************************/
void Check_Busy()
{

	unsigned char tmp;
	unsigned int timeout_cnt=0; //定义等待超时计数器

	P3DIR = 0x00; //把数据口设置为数字输入方式
	CLR1602_EN;          //EN = 0;
	CLR1602_RS;          //RS = 0;
	SET1602_RW;          //RW = 1;

	SET1602_EN;          //EN = 1;
	delay_nns(16);		 //这里至少需要延时450ns
	do
	{
	timeout_cnt++;       //超时计数器计数
	tmp = P3IN;
	}while((tmp & 0x80)&&(timeout_cnt<6000));//等待忙信号或者超时
	P3DIR = 0xff;
	CLR1602_EN;          //EN = 0;
	delay_nns(16);		 //这里至少需要延时450ns
}

/**************************************************************************************************
** 函数名称:Write1602_Com
** 功能描述:对lcd写指令
** 入口参数：commd---指令码
** 返回参数：
***************************************************************************************************/
void Write1602_Com(unsigned char commd)
{ 
	Check_Busy();        //检测忙信号，在写命令的时候一定要检测忙信号
	CLR1602_EN;          //EN = 0;
	CLR1602_RS;          //RS = 0;
	CLR1602_RW;          //RW = 0;	

	LCD1602_DATA = commd;
	SET1602_EN;          //EN = 1;
	delay_nns(16);		 //这里至少需要延时450ns

	CLR1602_EN;          //EN = 0;
	delay_nns(16);		 //这里也至少需要延时450ns
}

/**************************************************************************************************
** 函数名称:Write1602_Data
** 功能描述:对lcd写数据
** 入口参数：dat---待写入的数据
** 返回参数：
***************************************************************************************************/
void Write1602_Data(unsigned char dat)
{
	CLR1602_EN;         //EN = 0;
	SET1602_RS;         //RS = 1;
	CLR1602_RW;         //RW = 0;

	LCD1602_DATA = dat;
	SET1602_EN;          //EN = 1;
	delay_nns(16);		 //这里至少需要延时450ns

	CLR1602_EN;          //EN = 0;
	delay_nns(16);		 //这里也至少需要延时450ns
} 

/**************************************************************************************************
** 函数名称:LCD1602_Init
** 功能描述:lcd1602初始化
** 入口参数:
** 返回参数:
***************************************************************************************************/
void LCD1602_Init(void)
{
	LCD1602_CMDOut;

	delay_Nms(100);
	Write1602_Com(0x38); //8为数据口 两行显示 5*7点阵
  
	delay_Nms(10);
	Write1602_Com(0x38); 

	delay_Nms(10);
	Write1602_Com(0x38); 
	Write1602_Com(0x38);
	Write1602_Com(0x08);  //显示关 光标关 闪烁关
	Write1602_Com(0x01);  //清DDRAM内容 及清屏
	Write1602_Com(0x06);  //AC自动增一 画面不动
	Write1602_Com(0x0c);  //开显示 关光标 关闪烁

}

/**************************************************************************************************
** 函数名称:LCD_SET_CURSOR
** 功能描述:光标位置设定，由行列参数确定（1，16）（2，1）
** 入口参数:line---表示行号(取值为1,2),column---表示列号(取值为1~16)
** 返回参数:
***************************************************************************************************/
void LCD_SET_CURSOR(unsigned char line,unsigned char column)
{
	switch(line)
	{
    	case 1: Write1602_Com(0x80 + column-1);//光标定位
        		break;
        case 2: Write1602_Com(0xc0 + column-1);//光标定位
                break;
        default: break;
    }
}

/**************************************************************************************************
** 函数名称:Printp00
** 功能描述:显示str[]的内容，要指明数组中数据的个数
** 入口参数:str---字符串数据首地址,n---显示字符串的个数
** 返回参数:
***************************************************************************************************/
void Print(unsigned char *str,unsigned char n)
{
	unsigned char i;

	for(i=0;i<n;i++)
	{
		Check_Busy(); 
		Write1602_Data(*str);
		str++;
	}
}



